"{items:["{"title":"Laptop Accessories","data":[{"title":"MATEIN Travel Laptop Backpack, Business Anti Theft Slim Durable Laptop Backpack with USB Charging Port, Water Resistant College Bag Computer Bag Gifts for Men & Women Fits 15.6 Inch Notebook, Grey","price":"$29.99","priceBeforeDiscount":"$39.96","images":["https://m.media-amazon.com/images/I/51grvfywmKL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51HlzBZ0raL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51KWl9X8apL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51grSLhpWIL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51zKP-T-F4L._AC_US40_.jpg","https://m.media-amazon.com/images/I/51qTdOUGFoL._AC_US40_.jpg","https://m.media-amazon.com/images/I/61gyWXwjmCL.SS40_BG85,85,85_BR-120_PKdp-play-icon-overlay__.jpg","https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/transparent-pixel._V192234675_.gif"],"sizes":["14 Inch","15.6 Inch","17 Inch","18 Inch"],"rateCount":"86,701 ratings","brand":"Visit the MATEIN Store","colors":["Light Pink","Periwinkle Blue","Red","Austere Grey","Beige","Black Charcoal","Blue","Camouflage","Galaxy","Grey and Black Camo","Lavender Purple","Light Blue","Tawny Brown","Yellow","Black","Bright Yellow","Camo Brown","Camo Grey","Dark Brown","Deep Red","Galaxy Blue","Light Gray","Navy Blue","Deep Black","Grey"],"features":["★LOTS OF STORAGE SPACE&POCKETS: One separate laptop compartment hold 15.6 Inch Laptop as well as 15 Inch,14 Inch and 13 Inch Laptop. One spacious packing compartment roomy for daily necessities,tech electronics accessories. Front compartment with many pockets, pen pockets and key fob hook, makes your items organized and easier to find","★COMFY&STURDY: Comfortable soft padded back design with thick but soft multi-panel ventilated padding, gives you maximum back support. Breathable and adjustable shoulder straps relieve the stress of shoulder. Foam padded top handle for a long time carry on","★FUNCTIONAL&SAFE: A luggage strap allows backpack fit on luggage/suitcase, slide over the luggage upright handle tube for easier carrying. With a hidden anti theft pocket on the back protect your valuable items from thieves. Well made for international airplane travel and day trip as a travel gift for men","★USB PORT DESIGN: With built in USB charger outside and built in charging cable inside,this usb backpack offers you a more convenient way to charge your phone while walking. It's a great tech gift for him from wife, daughter and son. Please noted that this backpack doesn't power itself, usb charging port only offers an easy access to charge","★DURABLE MATERIAL&SOLID: Made of Water Resistant and Durable Polyester Fabric with metal zippers. Ensure a secure & long-lasting usage everyday & weekend.Serve you well as professional office work bag,slim USB charging bagpack, back to college backpacks. Recommended age range: 5 years old and up"],"rating":"4.7 out of 5 stars"},{"title":"YOREPEK Travel Backpack, 50L Extra Large Laptop Backpacks for Men Women, Water Resistant College Backpack Airline Approved Business Work Bag with USB Charging Port Fits 17 Inch Computer, Black","price":"$33.99","priceBeforeDiscount":"$59.99","images":["https://m.media-amazon.com/images/I/410mJ1QDn+L._AC_US40_.jpg","https://m.media-amazon.com/images/I/51Jz-vBV-JL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51p5UB9P-QL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51MsxqK-EPL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51PUqb1pNqL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51H0Izz7utL._AC_US40_.jpg","https://m.media-amazon.com/images/I/A1k8KtA17zL.SS40_BG85,85,85_BR-120_PKdp-play-icon-overlay__.png","https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/transparent-pixel._V192234675_.gif"],"sizes":["15.6 inch","17 inch","18.4 inch"],"rateCount":"38,373 ratings","brand":"Visit the YOREPEK Store","colors":["Black","Blue","Bright Red","Camouflage","Cobalt Blue","Grey","Light Grey","Pink","Purple","Red","Roy Blue"],"features":["Large Capacity & Organized: The large backpack owns 3 spacious compartments-one separate laptop compartment that fits 17-inch laptops, and one main compartment roomy for daily necessities, such as clothes, notebooks, etc. The front compartment has many small pockets, as well as pen pockets and a keychain design to keep your things organized. The large backpack for men has 10+ pockets, including 2 side mesh pockets for water bottles and umbrellas. Size: 18\"x13.5\"x6.5\"","TSA Approve & Multipurpose: At checkpoints, the large travel backpack can be freely unfolded 90-180 degrees, allowing you to quickly pass through airport security and keep things tidy, exclusively designed for airplane travel. A luggage strap allows the traveling backpack to fit on the suitcase, great for international plane travel and day trips","Practical & Convenient: External USB port with built-in charging cable conveniently charges your phone and other electronic devices (pls provide your own portable charger). A hole in the travel laptop backpack is used for the outside of the earphone, which can be used conveniently. Besides, the large laptop backpack has a sturdy handle with a steel cable on top for easy portability. Side compression straps keep the exclusive pack in any size you need","Durable Material: Made of water-resistant and durable polyester fabric, and high-density nylon lining for better tear resistance, the heavy-duty backpack with metal zippers ensures daily long-lasting use. Serve you well as a professional office work backpack, and large USB charging Backpack. An ideal present for back to college, graduation, parents, Thanksgiving, Christmas, Valentine's Day","Comfortable: With a comfortable padded back design and thick and soft multi-panel ventilated pads, the big backpack gives you great back support. Breathable and adjustable shoulder straps relieve shoulder pressure to reduce discomfort in long packs. The backpack for men and women will be a good partner for travel. THIS ITEM IS NOT INTENDED FOR USE BY CHILDREN 12 AND UNDER"],"rating":"4.7 out of 5 stars"},{"title":"SUPACOOL Lightweight Casual Laptop Backpack with USB Charging Port For for Men and Women, Daily use backpack, Backpack for College (Full Black)","price":"$24.99","priceBeforeDiscount":"","images":["https://m.media-amazon.com/images/I/31jnarnaLLL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51tuxD7d54L._AC_US40_.jpg","https://m.media-amazon.com/images/I/51dp0pPPO4L._AC_US40_.jpg","https://m.media-amazon.com/images/I/41KM8vRn+fL._AC_US40_.jpg","https://m.media-amazon.com/images/I/41Cp5-HoRuL._AC_US40_.jpg","https://m.media-amazon.com/images/I/41j5equ+XtL._AC_US40_.jpg","https://m.media-amazon.com/images/I/A1GD1lYwnCL.SS40_BG85,85,85_BR-120_PKdp-play-icon-overlay__.jpg","https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/transparent-pixel._V192234675_.gif"],"sizes":[],"rateCount":"3,821 ratings","brand":"SUPACOOL","colors":["Army Green","Black Set","Black and Brown","Black and Brown Set","Burgundy Red","Coffee","Coffee Set","Flap","Full Black","Full Black and Yellow","Garnet","Garnet Set","Graffiti","Green","Grey","Holo Green","Holo Purple","Light Grey","Light Grey and Brown","Navy Blue","Navy and Brown","Olive","Olive Set","Peace","Pink","Purple and Brown","Red"],"features":["HIGH QUALITY and WATERPROOF: Made of high quality waterproof oxford 300D fabric,durable and wearing-resisting. Adjustable shoulder straps can prevent them from slipping, and make the slim laptop backpack fit your body shape and shoulders better.","LOT OF STORAGE: The laptop backpack offers a lot of storage space due to the compartments.You can put laptop,iPad, power bank,camera,books and other item you need and keep it organized.The backpack can hold up to 15.6 inch laptops.","USB CHARGE PORT: With built in USB charger outside and built in charging cable inside,this USB backpack offers you a more convenient way to charge your phone while walking. Please noted that this backpack doesn't power itself, usb charging port only offers an easy access to charge.","MULTI FUNCTIONAL: It's a perfect backpack for leisure, hiking, camping, trekking, air travelling, walking, outdoor sports, shopping, business trip and overnight stay.","SIZE: 16.9*12.6*5.1 inches. Simple contructions with several pockets for you to hold things you need on business, daily life or traveling."],"rating":"4.4 out of 5 stars"},{"title":"Baseus Laptop Docking Station Dual Monitor, 9 in 1 USB C Hub with 1000Mbps LAN, 2 HDMI 4K, 100W PD, SD/TF Card Reader, 3 USB, USB C Dock Compatible with MacBook/Dell/HP/Surface/Lenovo/Steam Deck","price":"$45.99","priceBeforeDiscount":"$69.99","images":["https://m.media-amazon.com/images/I/41uzH52iFoL._AC_US40_.jpg","https://m.media-amazon.com/images/I/41DHBEWcJXL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51fs5R4PWxL._AC_US40_.jpg","https://m.media-amazon.com/images/I/41U+FzRp5GL._AC_US40_.jpg","https://m.media-amazon.com/images/I/41Luquus4KL._AC_US40_.jpg","https://m.media-amazon.com/images/I/41UBvpDOonL._AC_US40_.jpg","https://m.media-amazon.com/images/I/71OBbePvy0L.SS40_BG85,85,85_BR-120_PKdp-play-icon-overlay__.jpg","https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/transparent-pixel._V192234675_.gif"],"sizes":[],"rateCount":"2,674 ratings","brand":"Baseus","colors":[],"features":["【120Hz USB C to HDMI Adapter】Simply connect docking station with the HDMI port and you can enjoy Ultra HD audio instantly(Single Display Up to 4K@120Hz). Hdmi splitter for dual monitors support mirror or extend mode with crystal clear 3D visual and high quality video experience through 2 HDMI ports. You can do different project on different monitors which provide you more space for work, good for home office.","【Stable 1000Mbps Ethernet】USB to ethernet adapter provides faster data transfers and better security than most Wi-Fi connections; Simply Plug the usb c hub to your laptop and plug in an ethernet cable, you will enjoy an ultra-fast surfing feeling. Baseus usb docking station which is the Ideal solution for unstable Wi-Fi or a failed network card.","【Fast Power Delivering Hub】The usb c multiport adapter equipped with one type-c charging port for connecting extra power supply which supports charging your laptop(Powered up to 85W). No need to worry about losing laptop's power when usb c docking station fully loaded. Note: There is not equipped with an additional charging cable.","【Advance USB C Card Reader】The laptop docking station dual monitor with light and compact body also insert SD and TF slots. You can transfer photos in seconds to your laptop with highest speed up to 104MB/s and conveniently browse photos instantly on your USB-C smartphones/laptops. USB c dock is perfect for Photographer or Designer or Video editor,etc.","【Effortless Data Transfer】Built in 2*USB3.0 + 1*USB2.0 Ports, which fulfill high speed rates data transfer and wide range of applications at the same time. USB 3.0 ports support up to 5Gbps transmission speed rates, fast enough to transfer HD movie in seconds. And usb c adapter comes with a USB 2.0 port, perfect to connect a keyboard, mouse or other USB A connected peripherals without any lag."],"rating":"4.4 out of 5 stars"},{"title":"KEOFID classic carry-on travel backpack for men and women, Anti theft laptop backpack with USB charging port, work backpack, large backpack for college, water resistent, gift for friends(BLACK)","price":"$34.99","priceBeforeDiscount":"","images":["https://m.media-amazon.com/images/I/31qI+fZGD9L._AC_US40_.jpg","https://m.media-amazon.com/images/I/51QGUH2bv6L._AC_US40_.jpg","https://m.media-amazon.com/images/I/51i3-1VEgTL._AC_US40_.jpg","https://m.media-amazon.com/images/I/41O2kdrquRL._AC_US40_.jpg","https://m.media-amazon.com/images/I/51YZlb6bm0L._AC_US40_.jpg","https://m.media-amazon.com/images/I/515+e9yRiEL._AC_US40_.jpg","https://m.media-amazon.com/images/I/41Rqc6B6o-L.SS40_BG85,85,85_BR-120_PKdp-play-icon-overlay__.jpg","https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/transparent-pixel._V192234675_.gif"],"sizes":["16.9 Inches","17.3 Inches","19 Inches"],"rateCount":"492 ratings","brand":"KEOFID","colors":["Black","Black and Brown","Burgundy","Camouflage","Carbon and Gold","Dark Black","Dirty Pink","Flamingo","Flower","Full Black","Gold","Grey","Leaves","Light Purple","Navy","Pink","Salmon Pink","Sunflower"],"features":["Material and Size: KEOFID laptop backpack is made of high quality water-resistant, durable fabric provides a sturdy and chic exterior. The backpack SIZE is 17.3*12.6*7.2 inches, easy to organize all personal items and fit up to 15.6\" laptops.","Classic Design:Total 4 compartments and two side pockets,main compartment with 15.6” laptop pocket and an extra padded sleeve for tablets or Kindle, can storage books and business files while still having room for daily necessities, front compartment with organizer and 2 front pockets provide plenty of capacity for the organization. 2 elastic side pockets can fit different size of bottles.","Multi Function:Our backpacks with a built-in USB charging port, easy to charge your phone when on-the-go (Not includes the power bank). With a luggage belt on the back panel, it is easy to put on the luggage handle when travel. One hidden anti-theft pocket to protect your important items.","USAGE:This water resistant laptop backpack will be a perfect backpack for College. Also as a casual travel backpack for travel, work backpack for business. A good gift choice for men and women, present for christmas.","No-Risk-Purchase & Quality warranty: KEOFID backpacks provide a 12-hour customer service and 1-year warranty policy, if you have any problem with the backpack, please contact us anytime."],"rating":"4.7 out of 5 stars"}]}",""{items:[""{items:["